app/controllers/reimbursements_controller.rb

SELECT "reimbursements".* FROM "reimbursements"
SELECT "reimbursements".* FROM "reimbursements" WHERE "reimbursements"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    return render json: {error: "No authorized principal"}, status: :unauthorized unless current_user
    if current_user&.manager?
      @reimbursement = Reimbursement.all
      puts @reimbursement.inspect
      {status: [201, "Displayed reimbursement"]}
      render json: {reimbursement: @reimbursement}
    else
      @reimbursement =Reimbursement.find_by(user_id: current_user.id)

SELECT "reimbursements".* FROM "reimbursements" WHERE "reimbursements"."id" = $1 ORDER BY "reimbursements"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reimbursements" WHERE "reimbursements"."id" = $1  [["id", 1]]
SELECT "reimbursements".* FROM "reimbursements" WHERE "reimbursements"."id" = $1 ORDER BY "reimbursements"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "reimbursements" WHERE "reimbursements"."id" = $1  [["id", 10]]
---
  def destroy
    if current_user&.manager?
      @reimbursement = Reimbursement.where(id: params[:id]).first
      if @reimbursement
        @reimbursement.delete if @reimbursement
        {status: [201, "Deleted"]}
      else
        {status: [204, "No content"], body: {message: 'Deleted'}}
      end
    else
      @reimbursement = current_user&.Reimbursement.where(id: params[:id]).first
      if @reimbursement
        @reimbursement.delete if @reimbursement

SELECT "reimbursements".* FROM "reimbursements" WHERE "reimbursements"."id" = $1 ORDER BY "reimbursements"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reimbursements" SET "id" = $1, "amount" = $2, "updated_at" = $3 WHERE "reimbursements"."id" = $4  [["id", 2], ["amount", 600.0], ["updated_at", "2023-04-10 00:33:31.509513"], ["id", 1]]
UPDATE "reimbursements" SET "description" = $1, "amount" = $2, "user_id" = $3, "updated_at" = $4 WHERE "reimbursements"."id" = $5  [["description", "big narwhal"], ["amount", 400.0], ["user_id", 1], ["updated_at", "2023-04-14 15:29:09.922138"], ["id", 12]]
---
  def update
    @reimbursement = Reimbursement.where(id: params[:id]).first
    puts "Updating request #{@reimbursement}"
    @reimbursement.update(JSON.parse(request.body.read))
    {body: {amount: @reimbursement.amount}}
    if @reimbursement.save

INSERT INTO "reimbursements" ("description", "status", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Giant dog"], ["status", "pending"], ["amount", 800.0], ["user_id", 1], ["created_at", "2023-04-10 00:39:40.845640"], ["updated_at", "2023-04-10 00:39:40.845640"]]
---
  def create # POST /users/:user_id/lists
    data = JSON.parse(request.body.read)
    data[:user_id] = current_user.id
    @reimbursement = Reimbursement.new(data)
    if @reimbursement.save