app/controllers/reimbursements_controller.rb

  def show
    return render json: {error: "No authorized principal"}, status: :unauthorized unless current_user

    if current_user&.manager?
      @reimbursement = Reimbursement.all
      puts @reimbursement.inspect
      {status: [201, "Displayed reimbursement"]}
      render json: {reimbursement: Reimbursement}
    else
      @reimbursement =Reimbursement.find_by(user_id: current_user.id)
---
SELECT "reimbursements".* FROM "reimbursements" WHERE "reimbursements"."user_id" = $1  [["user_id", 2]]