app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "da_boss@localhost.com"], ["LIMIT", 1]]
---
  def create
    credentials = JSON.parse(request.body.read)
    user = User.where(email: credentials['email']).first