app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    return render json: {error: "No authorized principal"}, status: :unauthorized unless current_user
    if current_user&.manager?
      @user = User.all

INSERT INTO "users" ("name", "email", "password_digest", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Jack"], ["email", "jackbutt@localhost.com"], ["password_digest", "[FILTERED]"], ["role_id", 2], ["created_at", "2023-04-14 06:30:47.647873"], ["updated_at", "2023-04-14 06:30:47.647873"]]
---
  def create
    if current_user&.manager?
      #@user = User.new(@request[:body])
      @user = User.new(JSON.parse(request.body.read))
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    if current_user&.manager?
      @user = User.where(id: params[:id]).first
      if @user
        @user.delete if @user